[
  {
    "title": "Projet 1: Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
    "description": "<h3>Mission:</h3> Intégrer une interface utilisateur responsive, adaptée à différents types d'écrans, pour offrir une expérience utilisateur fluide et agréable. <br><br><h3>Détails:</h3> Utilisation de HTML et CSS pour la structure et le design de l'interface.<br>Application des techniques de responsive design pour une compatibilité optimale sur tous les appareils.",
    "image": "booki.webp",
    "evaluation": "<h3>Points forts:</h3> La page HTML est codée avec les balises fondamentales attendues.La page est responsive.Le CSS est séparé du code HTML.Les fonctionnalités attendues sont disponibles.<br><h3>Axes d'amélioration:</h3> Pensée à respecter les bonnes pratiques Git.",
    "link": "https://github.com/RoxanaDC/booki",
    "sitedeployed": "https://roxanadc.github.io/booki/",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Eric Legba",
    "evaluatorpage": "https://openclassrooms.com/fr/members/g29pmcx5tl55"
  },

  {
    "title": "Projet 2: Créez une page web dynamique avec JavaScript",
    "description": "<h3>Mission:</h3> Intégration d'une interface responsive pour une expérience utilisateur fluide. <br><br><h3>Détails:</h3> Développement de la partie Front-End avec HTML fourni.Gestion des événements utilisateur et manipulation du DOM avec JavaScript.Création de la page de connexion admin et modale d'upload de médias.Interaction avec le code back-end et apprentissage de l'utilisation d'une API.Test avec le compte admin: <strong>email: sophie.bluel@test.tld</strong>, <strong>mdp: S0phie</strong>.Le back-end est déployé sur Railway, le front-end sur GitHub.",

    "image": "sophie.webp",
    "evaluation": "<h3>Commentaires:</h3> Les travaux de l’architecte dans la galerie sont bien récupérés depuis l’API.Le menu de catégories permettant le filtrage a bien été généré dynamiquement.Lorsque l’on est connecté, il est possible de supprimer un des travaux sans recharger la page, et le changement se voit directement.Il est également possible d’ajouter un travail, et il s’ajoute à la galerie sans nécessité de recharger la page.Une présentation fluide et complète en 15 minutes avec support.Dans l’ensemble, Roxana a bien répondu à mes questions et a rapidement fait la correction demandée.Félicitations et bonne continuation.",
    "link": "https://github.com/RoxanaDC/Sophie_Bluel",
    "sitedeployed": "https://roxanadc.github.io/Sophie_Bluel/",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Thierry Raimond",
    "evaluatorpage": "https://openclassrooms.com/fr/members/mcz5h488s2m7"
  },

  {
    "title": "Projet 3:  Débuggez et optimisez un site de photographe",
    "description": "<h3>Mission:</h3> Optimisation du référencement d'un site web pour améliorer ses performances et son accessibilité. <br><br><h3>Détails:</h3> Analyse des problèmes de chargement et référencement avec des outils comme Lighthouse et Wave.Proposition de recommandations pour améliorer la vitesse, la structure du code et le SEO.Application des recommandations pour optimiser le code et faciliter le référencement.Rédaction d'un rapport détaillant les résultats avant et après, avec des captures d'écran des audits et explications des changements.",
    "image": "optimisez.webp",
    "evaluation": "<h3>Évaluation:</h3> L'étudiante a présenté son travail de manière claire et structurée, démontrant une bonne maîtrise des outils et des techniques utilisés.Elle a montré une compréhension approfondie des objectifs d'optimisation et de débogage.La présentation a été convaincante et bien argumentée, avec une capacité à répondre efficacement aux questions posées.",
    "link": "https://github.com/RoxanaDC/Nina_Carducci_Dev",
    "sitedeployed": "https://roxanadc.github.io/Nina_Carducci_Dev/",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Lhassan Aberwag",
    "evaluatorpage": "https://openclassrooms.com/fr/members/46zj113d2lw4"
  },

  {
    "title": "Projet 4: Application web, de location immobilière avec React",
    "description": "<h3>Mission:</h3> Développement du front-end d'une application avec React et React Router pour une expérience utilisateur moderne et interactive. <br><br><h3>Détails:</h3> Création des composants React et gestion de la présentation des données pour des interfaces dynamiques.Configuration de la navigation avec React Router pour une gestion du routage fluide dans l'application.",
    "image": "kasa.webp",
    "evaluation": "<h3>Points forts:</h3> Utilisation de React.Utilisation de Sass.Application conforme aux spécifications.<br><h3>Remarques:</h3> Très bonne présentation orale/visuelle avec un support.Respect du timing.L'étudiante a su répondre aux questions.Bravo.",
    "link": "https://github.com/RoxanaDC/Kasa_005",
    "sitedeployed": "https://roxanadc.github.io/Kasa_005/",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Amadou Oury Diallo",
    "evaluatorpage": "https://openclassrooms.com/fr/members/cqc611mwnt98"
  },

  {
    "title": "Projet 5: Backend d'un site de notation de livres",
    "description": "<h3>Mission:</h3> Développement du back-end de l'application 'Mon Vieux Grimoire' pour un site de notation de livres. <br><br><h3>Détails:</h3> Création d’un serveur avec Express pour gérer les requêtes et réponses HTTP.Connexion à MongoDB pour la gestion des données des utilisateurs et des livres.Création de modèles de données et opérations CRUD pour une gestion complète des informations.Sécurisation des données et mise en place d'un système d'authentification.Fonctionnalité de téléchargement et d’optimisation des images.Fonctionnalité de notation des livres avec calcul automatique de la moyenne des évaluations.",
    "image": "grimoire.webp",
    "evaluation": "<h3>Évaluation:</h3> Roxana a mené la soutenance de manière très professionnelle, avec une bonne maîtrise de son sujet.Elle a su répondre avec assurance aux questions posées et a démontré une excellente compréhension des aspects techniques du projet.Son attitude positive face aux axes d'amélioration était très appréciable, et cela montre une bonne volonté de progression.Félicitations Roxana et bonne chance pour la suite !",
    "link": "https://github.com/RoxanaDC/Backend_Mon_Vieux_Grimoire",
    "sitedeployed": "https://github.com/RoxanaDC/Backend_Mon_Vieux_Grimoire",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Osiris Migan",
    "evaluatorpage": "https://openclassrooms.com/fr/members/8tw73v12q599"
  },

  {
    "title": "Projet 6: Planifiez le développement du site de votre client",
    "description": "<h3>Mission:</h3> Planification du développement d'un site web sans coder. <br><br><h3>Détails:</h3> Analyse de la maquette, des spécifications et des User Stories, avec veille technologique via Feedly.Rédaction des spécifications techniques et décomposition des fonctionnalités en tâches avec Notion.Organisation du projet avec un tableau Kanban et présentation de la solution technique.",
    "image": "kanban.webp",
    "evaluation": "<h3>Points forts:</h3> Les livrables sont conformes à ce qui est attendu.Des livrables dans l'ensemble très complets.<br><h3>Axes d'amélioration:</h3> Les diapositives sont un peu surchargées, n'hésitez pas à alléger et à faire des présentations plus simples.<br><h3>Remarques:</h3> Bonne soutenance dans l'ensemble ; mais attention à ne pas vouloir trop en faire, ce qui nuit à la qualité de la présentation finale, c'est dommage !Pensez à bien regarder la rubrique soutenance pour organiser la présentation, et mettre un timer pour respecter au mieux le temps demandé, ça vous aidera à mieux structurer et à ne pas trop en rajouter.Bonne continuation pour la suite !",
    "link": "https://rose-bus-88d.notion.site/Plan-d-veloppement-site-Menu-Maker-by-Qwenta-13fa46527cdb8040b17ff23c549054ad?pvs=4",
    "sitedeployed": "https://rose-bus-88d.notion.site/Plan-d-veloppement-site-Menu-Maker-by-Qwenta-13fa46527cdb8040b17ff23c549054ad?pvs=4",
    "hostedon": "Notion",
    "details": "le Kanban",
    "evaluatorname": "Maria Lena Pietri",
    "evaluatorpage": "https://openclassrooms.com/fr/members/w8stgdfrlpk3"
  },

  {
    "title": "Projet 7: Créez et publiez votre portfolio de développeur",
    "description": "<h3>Mission:</h3> Création d'un site web personnel pour mettre en valeur mes compétences et projets. <br><br><h3>Détails:</h3> Conception du site à partir d'une mind map sur miro.com, assurant une structure claire et intuitive.Portfolio reflétant mes compétences techniques à travers un code soigné et une interface fluide.Design adaptatif avec thèmes clair et sombre pour une expérience utilisateur cohérente et agréable.",
    "image": "portfolio.webp",
    "evaluation": "<h3>Points forts:</h3> Carte des compétences présente et complète.Les offres d'emplois indiquées correspondent totalement aux compétences acquises durant la formation.Portfolio hébergé en ligne avec toutes les rubriques attendues.Présentation de 2 projets de formation.Projet responsive.<br><h3>Soutenance - Remarques:</h3> Présentation fluide et structurée.Timing respecté.Chaque point du brief a été présenté et justifié.",
    "link": "https://github.com/RoxanaDC/portfolio",
    "sitedeployed": "https://github.com/RoxanaDC/portfolio",
    "hostedon": "GitHub",
    "details": "le code",
    "evaluatorname": "Aurélien Morvan",
    "evaluatorpage": "https://openclassrooms.com/fr/members/v2m3vcvkt967"
  }
]
