[
  {
    "title": "Projet 1: Application web, de location immobilière avec React",
    "description": "Dans ce projet, j'ai développé le front-end d'une application en utilisant React et React Router afin de créer une expérience utilisateur moderne et interactive. J'ai travaillé sur la logique de présentation des données et les composants React, pour concevoir des interfaces utilisateur dynamiques et réactives.Avec React Router, j'ai configuré la navigation entre les différentes pages de l'application, ce qui m'a permis de mieux comprendre la gestion efficace du routage dans une application web moderne.",
    "image": "kasa.webp",
    "evaluation": "Points forts : Utilisation de React. Utilisation de Sass. Application conforme aux spécs. Remarques : Très bonne présentation orale/visuelle avec un support. Respect du timing. L'étudiante a su répondre aux questions. Bravo.",
    "githublink": "https://github.com/RoxanaDC/Kasa_005",
    "evaluatorname": "Amadou Oury Diallo",
    "evaluatorpage": "https://openclassrooms.com/fr/members/cqc611mwnt98"
  },

  {
    "title": "Projet 2: Backend d'un site de notation de livres",
    "description": "Pour mon projet intitulé 'Mon Vieux Grimoire', un site de notation de livres, j'ai développé le back-end de l'application. Création d’un serveur avec Express, pour gérer les requêtes et réponses HTTP. Connexion à une base de données MongoDB, pour stocker et gérer efficacement les données des utilisateurs et des livres. Modèles de données et opérations CRUD (Créer, Lire, Mettre à jour, Supprimer) pour assurer une gestion complète des informations. Sécurisation des données et système d'authentification.La fonctionnalité de téléchargement et d’optimisation des images. La fonctionnalité pour noter les livres et calcule automatiquement la moyenne des évaluations.",
    "image": "grimoire.webp",
    "evaluation": "Roxana a mené la soutenance de manière très professionnelle, avec une bonne maîtrise de son sujet. Elle a su répondre avec assurance aux questions posées et a démontré une excellente compréhension des aspects techniques du projet. Son attitude positive face aux axes d'amélioration était très appréciable, et cela montre une bonne volonté de progression. Félicitations Roxana et bonne chance pour la suite !",
    "githublink": "https://github.com/RoxanaDC/Backend_Mon_Vieux_Grimoire",
    "evaluatorname": "Osiris Migan",
    "evaluatorpage": "https://openclassrooms.com/fr/members/8tw73v12q599"
  },

  {
    "title": "Projet 3: Portfolio",
    "description": "Dans le cadre de ce projet, j'ai conçu et développé un site web qui me permet de me présenter, de mettre en avant mes compétences, et de lister les projets sur lesquels j'ai travaillé. Pour ce faire, je me suis basée sur une mind map afin de structurer et hiérarchiser les informations clés à afficher, telles que mes compétences techniques et les projets réalisés. Le portfolio a également été conçu pour démontrer mes capacités techniques, non seulement à travers le contenu présenté, mais aussi via la qualité du code utilisé pour le site et une interface utilisateur intuitive et attrayante. Ce projet reflète mon souci du détail et ma volonté de livrer un produit fonctionnel et esthétique.",
    "image": "portfolio.webp",
    "evaluation": "Points forts : Carte des compétences présente et complète. Les offres d'emplois indiquées correspondent totalement aux compétences acquises durant la formation. Portfolio hébergé en ligne. Les différentes rubriques attendues sont bien présentes. La présentation de 2 projet de formation est présente. Projet responsive. Soutenance - Remarques : Présentation fluide & structurée. Timing respecté. Chaque point du brief a été présenté. Tous les choix ont été justifié",
    "githublink": "https://github.com/RoxanaDC/portfolio",
    "evaluatorname": "Aurélien Morvan",
    "evaluatorpage": "https://openclassrooms.com/fr/members/v2m3vcvkt967"
  },

  {
    "title": "Projet 4: Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
    "description": "Dans le cadre de ce projet, j'ai créé la page d'accueil d'une agence de voyage en utilisant HTML et CSS. Ma mission principale consistait à intégrer une interface utilisateur responsive, adaptée à différents types d'écrans, afin d'offrir une expérience utilisateur fluide et agréable. Ce projet m'a permis de renforcer mes compétences en intégration web et en conception d'interfaces modernes et fonctionnelles.",
    "image": "booki.webp",
    "evaluation": "Points forts : La page HTML est codée avec les balises fondamentales attendues. La page est responsive. Le CSS est séparé du code HTML. Les fonctionnalités attendues sont disponible. Axes d'amélioration : Penser à respecter les bonnes pratiques Git",
    "githublink": "https://github.com/RoxanaDC/booki",
    "evaluatorname": "Eric Legba",
    "evaluatorpage": "https://openclassrooms.com/fr/members/g29pmcx5tl55"
  },

  {
    "title": "Projet 5: Créez une page web dynamique avec JavaScript",
    "description": "Dans ce projet, j'ai créé une page web dynamique pour le site internet d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API. Mon travail a consisté à développer la partie Front-End du site, notamment la page de présentation des travaux de l'architecte à partir d'un fichier HTML fourni. J'ai géré les événements utilisateurs et manipulé les éléments du DOM avec JavaScript pour rendre l'interface interactive. J'ai également conçu une page de connexion pour l'administrateur du site ainsi qu'une modale permettant l'upload de nouveaux médias. Ces éléments ont été développés from scratch, ce qui m'a permis d'approfondir mes compétences en JavaScript. Pour la première fois, j'ai interagi avec un code back-end afin de tester les fonctionnalités, et j'ai appris à communiquer avec une API.",
    "image": "sophie.webp",
    "evaluation": "Commentaires : Les travaux de l’architecte dans la galerie sont bien récupérés depuis l’API. Le menu de catégories permettant le filtrage a bien été généré dynamiquement. Lorsque l’on est connecté: il est possible de supprimer un des travaux. Cela ne recharge pas la page, et le changement se voit directement. Il est également possible d’ajouter un travail. Le travail s’ajoute à la galerie sans nécessité de recharger la page. Une présentation fluide et complète en 15 minutes avec support. Dans l’ensemble Roxana a bien répondu à mes questions et a rapidement fait la correction demandée. Félicitation et bonne continuation",
    "githublink": "https://github.com/RoxanaDC/Sophie_Bluel",
    "evaluatorname": "Thierry Raimond",
    "evaluatorpage": "https://openclassrooms.com/fr/members/mcz5h488s2m7"
  },

  {
    "title": "Projet 6:  Débuggez et optimisez un site de photographe",
    "description": "Dans ce projet, j'ai travaillé en tant que développeur freelance pour optimiser le référencement d'un site web en améliorant ses performances et son accessibilité. Ma première étape a été d'identifier les problèmes de chargement et de référencement du site. Pour cela, j'ai utilisé des outils comme Lighthouse et Wave afin d'évaluer les performances actuelles et l'accessibilité. J'ai ensuite proposé des recommandations pour améliorer la vitesse de chargement, la structure du code et le référencement. Après validation, j'ai appliqué ces recommandations en modifiant le code du site, avec pour objectif d'optimiser ses performances et de faciliter son référencement sur les moteurs de recherche. Enfin, j'ai élaboré un rapport détaillant les résultats avant et après les modifications. Ce rapport comprenait des captures d'écran des audits ainsi que des explications sur les changements apportés et leur impact positif sur le référencement et l'accessibilité du site.",
    "image": "optimisez.webp",
    "evaluation": "L'étudiante a présenté son travail de manière claire et structurée, démontrant une bonne maîtrise des outils et des techniques utilisés. Elle a montré une compréhension approfondie des objectifs d'optimisation et de débogage. La présentation a été convaincante et bien argumentée, avec une capacité à répondre efficacement aux questions posées.",
    "githublink": "https://github.com/RoxanaDC/Nina_Carducci_Dev",
    "evaluatorname": "Lhassan Aberwag",
    "evaluatorpage": "https://openclassrooms.com/fr/members/46zj113d2lw4"
  }
]
